index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<!-- 2015-03-27 Fri 13:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Sacha Chua" />
<link rel="stylesheet" type="text/css"
href="http://sachachua.com/blog/wp-content/themes/sacha-v3/foundation/css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="http://sachachua.com/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="http://sachachua.com/blog/wp-content/themes/sacha-v3/style.css"></link>
</head>
<body>
<div id="preamble" class="status">
<a name="top" id="top"></a>
</div>
<div id="content">
<h1 class="title"></h1>
<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Emacs Conference 2015?</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Let's make it happen! Contribute to this repository at
<a href="https://github.com/sachac/emacsconf2015">https://github.com/sachac/emacsconf2015</a>, or e-mail me at
<a href="mailto:sacha@sachachua.com">sacha@sachachua.com</a> . Web version: <a href="http://sachac.github.io/emacsconf2015">http://sachac.github.io/emacsconf2015</a>
</p>

<p>
Event - Aug 22, 2015? <a href="https://plus.google.com/events/cgd1kva6f473osvgvq6biuinhn4">https://plus.google.com/events/cgd1kva6f473osvgvq6biuinhn4</a>
</p>
</div>

<div id="outline-container-unnumbered-2" class="outline-3">
<h3 id="unnumbered-2">Ideas for sessions</h3>
<div class="outline-text-3" id="text-unnumbered-2">
</div><div id="outline-container-unnumbered-3" class="outline-4">
<h4 id="unnumbered-3">The State of Emacs</h4>
<div class="outline-text-4" id="text-unnumbered-3">
<p>
The kernel of this idea is basically to have a "State of the Union" address, where the Union is Emacs. I think it would be awesome if someone really embedded in Emacs development (specifically thinking of Stefan) talked about the current state of Emacs development with regards to
</p>
<ul class="org-ul">
<li>how development today is functioning. What are major development process problems that need to be fixed but haven't? What do the maintainers of Emacs stress about (letting patches rot in debbugs, having bugs rot in debbugs, being unsure of the general brokenness of Emacs because of the lack of testing), and what processes can be put in place to ease their anxieties?</li>
<li>new contributors. Making Emacs easier for new contributors was a <b>huge</b> topic in the Fall of 2014 on emacs-devel. The switch to git was seen as the first step, what were the next steps and how did they work?</li>
<li>whether anything surprisingly good/bad has happened this year.</li>
<li>the general state of emacs-devel.</li>
<li>and what we can do to help! :D</li>
</ul>
<p>
(suggested by Samer)
</p>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-4">
<h4 id="unnumbered-4">What's new in Emacs 25?</h4>
<div class="outline-text-4" id="text-unnumbered-4">
</div><ul class="org-ul"><li><a id="unnumbered-5"></a>What's new for users?<br  /></li>
<li><a id="unnumbered-6"></a>What's new for developers?<br  /></li></ul>
</div>
<div id="outline-container-unnumbered-7" class="outline-4">
<h4 id="unnumbered-7">Updates on interesting things</h4>
<div class="outline-text-4" id="text-unnumbered-7">
</div><ul class="org-ul"><li><a id="unnumbered-8"></a>Guile Emacs<br  /><div class="outline-text-5" id="text-unnumbered-8">
<p>
I think it would be awesome if Robin Templeton or BT Templeton (there is a chance that they're the same person, I'm still not clear on that&#x2026;) talked about the state of Guile Emacs.
</p>
<ul class="org-ul">
<li>What works? What's left to be done?</li>
<li>What does Guile replace in the core Emacs engine?</li>
<li><b>Is Guile Emacs the future of Emacs?</b> Is Guile Emacs going to <b>happen</b> and be merged into trunk at some point in the future? If so, what's needed to get us there, otherwise, why not?</li>
</ul>
<p>
And what can we do to help! :D :D
</p>

<p>
Suggested by Samer
</p>
</div></li></ul>
</div>

<div id="outline-container-unnumbered-9" class="outline-4">
<h4 id="unnumbered-9">What are some interesting uses of Emacs?</h4>
<div class="outline-text-4" id="text-unnumbered-9">
</div><ul class="org-ul"><li><a id="unnumbered-10"></a>Reproducible research<br  /><div class="outline-text-5" id="text-unnumbered-10">
<ul class="org-ul">
<li>How do you manage your literature review?</li>
<li>How do you analyze your data?</li>
<li>How do you work with charts and graphs?</li>
<li>How can you publish in the required formats?</li>
<li>What have your experiences been like using this? Advantages? Gaps?</li>
</ul>
</div></li></ul>
</div>
<div id="outline-container-unnumbered-11" class="outline-4">
<h4 id="unnumbered-11">What are good workflows for common needs?</h4>
<div class="outline-text-4" id="text-unnumbered-11">
</div><ul class="org-ul"><li><a id="unnumbered-12"></a>Programming<br  /><div class="outline-text-5" id="text-unnumbered-12">
<ul class="org-ul">
<li>C/C++</li>
<li>Rails</li>
<li>Javascript</li>
<li>Java</li>
<li>Clojure</li>
<li>Scala</li>
<li>Python</li>
</ul>
</div></li>

<li><a id="unnumbered-13"></a>Writing and research<br  /><div class="outline-text-5" id="text-unnumbered-13">
<ul class="org-ul">
<li>Reproducible research</li>
<li>Writing prose</li>
<li>Org for publishing</li>
<li>Knowledge management</li>
</ul>
</div></li></ul>
</div>
<div id="outline-container-unnumbered-14" class="outline-4">
<h4 id="unnumbered-14">How can people contribute to Emacs core?</h4>
<div class="outline-text-4" id="text-unnumbered-14">
<p>
Walkthrough of how to:
</p>
<ul class="org-ul">
<li>find a small bug to work on</li>
<li>navigate the source code</li>
<li>prepare a patch</li>
<li>work with emacs-devel</li>
</ul>
</div>
</div>
<div id="outline-container-unnumbered-15" class="outline-4">
<h4 id="unnumbered-15">How can packaging get even better?</h4>
<div class="outline-text-4" id="text-unnumbered-15">
<p>
Nic Ferrier? Steve Purcell? Milkypostman?
</p>
</div>
</div>
<div id="outline-container-unnumbered-16" class="outline-4">
<h4 id="unnumbered-16">What can we build with interesting capabilities available in Emacs? How?</h4>
<div class="outline-text-4" id="text-unnumbered-16">
<ul class="org-ul">
<li>httpd, elnode; skewer, impatient - @skeeto?</li>
<li>comint, NREPL</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-17" class="outline-4">
<h4 id="unnumbered-17">Design and Evolution of <a href="https://github.com/syl20bnr/spacemacs/">Spacemacs</a> by @syl20bnr</h4>
<div class="outline-text-4" id="text-unnumbered-17">
<ul class="org-ul">
<li>Why evil + spacebar</li>
<li>Why guide-key</li>
<li>Why layers</li>
<li>Vim concepts being brought over - Vundle, etc.</li>
<li>State of evil - what is not ideal yet? what are missing features from the ecosystem?</li>
<li>How can contributors help?</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-18" class="outline-4">
<h4 id="unnumbered-18">What can improve the usability of Emacs?</h4>
<div class="outline-text-4" id="text-unnumbered-18">
<p>
Concrete tips, demonstrations
</p>

<ul class="org-ul">
<li>tutorials</li>
<li>discoverability</li>
<li>command mode / god-mode / composable commands</li>
<li>Hydra</li>
</ul>

<p>
People: Xah Lee? bbatsov? Steve Purcell? abo-abo?
</p>
</div>
</div>

<div id="outline-container-unnumbered-19" class="outline-4">
<h4 id="unnumbered-19">What are good development practices for Emacs Lisp?</h4>
<div class="outline-text-4" id="text-unnumbered-19">
<ul class="org-ul">
<li>Automated testing</li>
<li>Continuous integration and testing on multiple Emacsen</li>
<li>Code coverage reporting</li>
<li>Emacs Lisp style and package linting</li>
<li>Refactoring</li>
<li>Performance</li>
</ul>
</div>
<ul class="org-ul"><li><a id="unnumbered-20"></a>Useful utilities<br  /><div class="outline-text-5" id="text-unnumbered-20">
<p>
Maybe with before/after code?
</p>

<ul class="org-ul">
<li>s.el</li>
<li>f.el</li>
<li>dash.el</li>
<li>writing asynchronous code</li>
</ul>
</div></li></ul>
</div>

<div id="outline-container-unnumbered-21" class="outline-4">
<h4 id="unnumbered-21">How can we get more people from beginner to intermediate?</h4>
</div>
<div id="outline-container-unnumbered-22" class="outline-4">
<h4 id="unnumbered-22">How can we get more people to begin using Emacs and stick with it for a while?</h4>
<div class="outline-text-4" id="text-unnumbered-22">
<ul class="org-ul">
<li>How can interactive tutorials do a better job of introducing and selling Emacs? - Phillip Lord?</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-23" class="outline-4">
<h4 id="unnumbered-23">Organizing Emacs meetups</h4>
<div class="outline-text-4" id="text-unnumbered-23">
</div><ul class="org-ul"><li><a id="unnumbered-24"></a>Identifying people by area who might be interested in an Emacs meetup<br  /><div class="outline-text-5" id="text-unnumbered-24">
<ul class="org-ul">
<li>San Francisco: Samer</li>
</ul>
</div></li></ul>
</div>

<div id="outline-container-unnumbered-25" class="outline-4">
<h4 id="unnumbered-25">Lightning talks: Workflow tips and favourite packages</h4>
<div class="outline-text-4" id="text-unnumbered-25">
<ul class="org-ul">
<li>Magit</li>
<li>Ebib</li>
<li>EWW</li>
<li>ESS</li>
</ul>
</div>
</div>
<div id="outline-container-unnumbered-26" class="outline-4">
<h4 id="unnumbered-26">Hackathons and workshops</h4>
<div class="outline-text-4" id="text-unnumbered-26">
</div><ul class="org-ul"><li><a id="unnumbered-27"></a>How can you create a package and submit it to the Emacs package repositories?<br  /></li>
<li><a id="unnumbered-28"></a>How can you build better interactive tutorials?<br  /><div class="outline-text-5" id="text-unnumbered-28">
<ul class="org-ul">
<li>Phillip Lord?</li>
</ul>
</div></li></ul>
</div>

<div id="outline-container-unnumbered-29" class="outline-4">
<h4 id="unnumbered-29">&#x2026;</h4>
</div>
</div>

<div id="outline-container-unnumbered-30" class="outline-3">
<h3 id="unnumbered-30">Tasks</h3>
<div class="outline-text-3" id="text-unnumbered-30">
</div><div id="outline-container-unnumbered-31" class="outline-4">
<h4 id="unnumbered-31"><span class="todo TODO">TODO</span> Collect ideas for sessions</h4>
<div class="outline-text-4" id="text-unnumbered-31">
<p>
What makes a good session?
</p>
<ul class="org-ul">
<li>Something that's great as a demonstration instead of a blog post with screenshots</li>
<li>Something that people have lots of questions about</li>
<li>Something that benefits from multiple perspectives (like a panel)</li>
</ul>
</div>
</div>
<div id="outline-container-unnumbered-32" class="outline-4">
<h4 id="unnumbered-32"><span class="todo TODO">TODO</span> Set up some kind of mailing list for announcements</h4>
</div>
<div id="outline-container-unnumbered-33" class="outline-4">
<h4 id="unnumbered-33"><span class="todo TODO">TODO</span> Decide on a date</h4>
<div class="outline-text-4" id="text-unnumbered-33">
<p>
August, maybe a Saturday?
</p>
</div>
</div>
<div id="outline-container-unnumbered-34" class="outline-4">
<h4 id="unnumbered-34"><span class="todo TODO">TODO</span> Find speakers</h4>
</div>
<div id="outline-container-unnumbered-35" class="outline-4">
<h4 id="unnumbered-35"><span class="todo TODO">TODO</span> Set up schedule</h4>
</div>
<div id="outline-container-unnumbered-36" class="outline-4">
<h4 id="unnumbered-36"><span class="todo TODO">TODO</span> Facilitate sessions and questions</h4>
</div>
</div>
</div>


<div id="outline-container-unnumbered-37" class="outline-2">
<h2 id="unnumbered-37">Comments</h2>
<div class="outline-text-2" id="text-unnumbered-37">
<p>
Contribute to this repository at
<a href="https://github.com/sachac/emacsconf2015">https://github.com/sachac/emacsconf2015</a>, or e-mail me at
<a href="mailto:sacha@sachachua.com">sacha@sachachua.com</a> . Looking forward to hearing from you!
</p>
</div>
</div>

<div id="outline-container-unnumbered-38" class="outline-2">
<h2 id="unnumbered-38">Thanks</h2>
<div class="outline-text-2" id="text-unnumbered-38">
<ul class="org-ul">
<li>Phillip Lord, Phil Hudson, Samer Masterson, &#x2026;</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<style type="text/css">
.back-to-top {
    position: fixed;
    bottom: 2em;
    right: 0px;
    text-decoration: none;
    color: #000000;
    background-color: rgba(235, 235, 235, 0.80);
    font-size: 12px;
    padding: 1em;
    display: none;
}

.back-to-top:hover {
    background-color: rgba(135, 135, 135, 0.50);
}
</style>

<div class="back-to-top">
<a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a>
</div>

<script type="text/javascript">
    var offset = 220;
    var duration = 500;
    jQuery(window).scroll(function() {
        if (jQuery(this).scrollTop() > offset) {
            jQuery('.back-to-top').fadeIn(duration);
        } else {
            jQuery('.back-to-top').fadeOut(duration);
        }
    });
</script>
</div>
</body>
</html>
